app/views/customers/index.html.erb

        <h3> Bank Name: </h3>
        <% customer.banks.each do |bank| %>
---
SELECT "banks".* FROM "banks" INNER JOIN "credit_cards" ON "banks"."id" = "credit_cards"."bank_id" WHERE "credit_cards"."customer_id" = ?  [["customer_id", 13]]