app/views/customers/new.html.erb

SELECT "credit_cards".* FROM "credit_cards"
---

    <%= f.select :credit_card_ids, options_from_collection_for_select(CreditCard.all, "id", "card_name") %><br>