app/controllers/banks_controller.rb

SELECT "banks".* FROM "banks" WHERE "banks"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
---
    def show
        @bank = Bank.find(params[:id])