app/controllers/banks_controller.rb

SELECT "banks".* FROM "banks"
---
    def index
        @banks = Bank.all

INSERT INTO "banks" ("name", "city", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Capital One"], ["city", "DC"], ["created_at", "2020-06-26 14:59:37.112879"], ["updated_at", "2020-06-26 14:59:37.112879"]]
---
    def create
        @bank = Bank.new(strong_params)
        @bank.save

UPDATE "banks" SET "name" = ?, "city" = ?, "updated_at" = ? WHERE "banks"."id" = ?  [["name", "Capital One "], ["city", "MD"], ["updated_at", "2020-06-26 15:01:46.363541"], ["id", 21]]
---
    def update
        bank_finder
        @bank.update(strong_params)

SELECT "banks".* FROM "banks" WHERE "banks"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
---
    def bank_finder
        @bank = Bank.find(params[:id])