app/controllers/customers_controller.rb

INSERT INTO "customers" ("name", "age", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Tien"], ["age", 30], ["created_at", "2020-06-26 01:35:32.724152"], ["updated_at", "2020-06-26 01:35:32.724152"]]
---
    def create
        @customer = Customer.new(strong_params)
        @customer.save

SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
UPDATE "customers" SET "age" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["age", 67], ["updated_at", "2020-06-26 02:10:34.165442"], ["id", 11]]
---
    def update
        @customer = Customer.find(params[:id])
        @customer.update(strong_params)

SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
DELETE FROM "customers" WHERE "customers"."id" = ?  [["id", 12]]
---
    def destroy
        @customer = Customer.find(params[:id])
        @customer.delete